Import relevant libraries

In [25]:
import pandas as pd

Load dataset

In [26]:
marketing_data = pd.read_csv("marketing_campaign.csv")

Subset for relevant columns

In [27]:
marketing_data = marketing_data[['ID', 'Year_Birth', 'Education','Income']]

Inspect first 5 rows and data types of the dataset

In [28]:
marketing_data.head()

     ID  Year_Birth   Education   Income
0  5524        1957  Graduation  58138.0
1  2174        1954  Graduation  46344.0
2  4141        1965  Graduation  71613.0
3  6182        1984  Graduation  26646.0
4  5324        1981         PhD  58293.0

In [29]:
marketing_data.shape

(2240, 4)

Check for missing values

In [30]:
# isnull count the NaN values in data and then show their sum means number of NaN values
marketing_data.isnull().sum()

ID             0
Year_Birth     0
Education      0
Income        24
dtype: int64

Drop Missing values

In [31]:
# dropna will remove the rows with NaN values
marketing_data_withoutna = marketing_data.dropna(how = 'any')
marketing_data_withoutna.head()

     ID  Year_Birth   Education   Income
0  5524        1957  Graduation  58138.0
1  2174        1954  Graduation  46344.0
2  4141        1965  Graduation  71613.0
3  6182        1984  Graduation  26646.0
4  5324        1981         PhD  58293.0

In [32]:
marketing_data_withoutna.shape

(2216, 4)